app/Views/layout/template-frontend.php

<?php
  $db = \Config\Database::connect();
  $setting = $db->table('tb_setting')->where('id','1')->get()->getRowArray();
  $ta = $db->table('tb_ta')->where('status','1')->get()->getRowArray();
---
SELECT *
FROM `tb_setting`
WHERE `id` = '1'
SELECT *
FROM `tb_ta`
WHERE `status` = '1'