app/Models/ModelPendaftaran.php

    public function getBiodatasiswa()
    {
        return $this->db->table('tb_siswa')
        ->join('tb_jalur', 'tb_jalur.id_jalur =tb_siswa.id_jalur')
       ->where('id_siswa', session()->get('id_siswa'))
       ->get()
       ->getRowArray();
---
SELECT *
FROM `tb_siswa`
JOIN `tb_jalur` ON `tb_jalur`.`id_jalur` =`tb_siswa`.`id_jalur`
WHERE `id_siswa` = '2'

    public function editData($data)
    {
       $this->db->table('tb_siswa')
       ->where('id_siswa', $data['id_siswa'])
       ->update($data);
---
UPDATE `tb_siswa` SET `id_siswa` = '2', `foto` = '1684552523_1609b38c949613f435c0.jpg'
WHERE `id_siswa` = '2'

    public function login_siswa($nisn, $password)
   {
        return $this->db->table('tb_siswa')->where(
            [
                'nisn'     => $nisn,
                'password'  => $password
            ]
        )->get()->getRowArray();
---
SELECT *
FROM `tb_siswa`
WHERE `nisn` = '1234567891'
AND `password` = '1234567891'