app/Models/ModelJalurMasuk.php

    public function getAllData()
    {
       return $this->db->table('tb_jalur')
       ->orderBy('id_jalur','ASC')
       ->get()
       ->getResultArray();
---
SELECT *
FROM `tb_jalur`
ORDER BY `id_jalur` ASC